data = [];
var dataStr = '1、test(1)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
2、test(2)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
3、test(3)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
4、test(4)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
5、test(5)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
6、test(6)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
7、test(7)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
8、test(8)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
9、test(9)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
10、test(10)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
11、test(11)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
12、test(12)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
13、test(13)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
14、test(14)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
15、test(15)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
16、test(16)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
17、test(17)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
18、test(18)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
19、test(19)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
<br>\
<br>\
20、test(20)<br>\
<br>\
导演：大鹏<br>\
编剧：好像还是大鹏<br>\
主演：大鹏 / 尚格云顿 / 袁姗姗/ 柳岩<br>\
类型：喜剧<br>\
国家：中国<br>\
语言：中文<br>\
上映日期：2015-07-17<br>\
片长：120分钟<br>\
';

var d = dataStr.split('<br><br><br>');

for(var i=0; i<d.length; i++) {
	var c = d[i].split('<br><br>');
	data.push({
		img: c[0].replace('、', ' ')+'.jpg',
		caption: c[0].split('、')[1],
		desc: c[1]
	});
	// console.log(data.caption);
}